jiangchiwu100/SmartTerminalUnit/imxrt1052/drivers/drv_eth_ATK.c
//    IOMUXC_SetPinConfig(
//        IOMUXC_GPIO_B1_09_ENET_TX_EN,          
//        0xB0E9u);                               

//    IOMUXC_SetPinConfig(
//        IOMUXC_GPIO_B1_07_ENET_TX_DATA00,       
//        0xB0E9u);                              

//    IOMUXC_SetPinConfig(
//        IOMUXC_GPIO_B1_08_ENET_TX_DATA01,      
//        0xB0E9u);                               

//    IOMUXC_SetPinConfig(
//        IOMUXC_GPIO_B1_09_ENET_TX_EN,           
//        0xB0E9u);                              

//    IOMUXC_SetPinConfig(
//        IOMUXC_GPIO_B1_10_ENET_REF_CLK,        
//        0x31u);                                 

//    IOMUXC_SetPinConfig(
//        IOMUXC_GPIO_B1_14_ENET_MDC,            
//        0xB0E9u);                               

//    IOMUXC_SetPinConfig(
//        IOMUXC_GPIO_B1_15_ENET_MDIO,           
//        0xB829u);                               

    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_04_ENET_RX_DATA00,0);                                   
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_05_ENET_RX_DATA01,0);                                    
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_06_ENET_RX_EN,0);                                    
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_07_ENET_TX_DATA00,0);                                    
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_08_ENET_TX_DATA01,0);                                   
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_09_ENET_TX_EN,0);                                    
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_10_ENET_REF_CLK,1);    //必须为1，否则网络工作不正常！                                                                   
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_14_ENET_MDC,0);                                   
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_15_ENET_MDIO,0);

    
    //设置复位和中断引脚
    //高转换速度,驱动能力为R0/5,速度为100Mhz，开路输出，使能pull/keepr
	//选择pull功能，上拉100K Ohm，关闭Hyst                             

    //设置网路引脚
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_04_ENET_RX_DATA00,0X110F9);                             
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_05_ENET_RX_DATA01,0X110F9);                            
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_06_ENET_RX_EN,0X110F9);                            
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_07_ENET_TX_DATA00,0X110F9);                               
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_08_ENET_TX_DATA01,0X110F9);                              
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_09_ENET_TX_EN,0X110F9);                               
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_10_ENET_REF_CLK,0X110F9);                                                      
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_14_ENET_MDC,0X110F9);                                   
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_15_ENET_MDIO,0X110F9);
    
    //使能网络的TX_CLK引脚输出功能
    IOMUXC_EnableMode(IOMUXC_GPR,kIOMUXC_GPR_ENET1TxClkOutputDir,true);
	IOMUXC_GPR->GPR1|=1<<23;		//ipg clk 总开启
}

static void _enet_clk_init(void)
{
    const clock_enet_pll_config_t config = {true, false, false, 1, 1};
    CLOCK_InitEnetPll(&config);

    IOMUXC_EnableMode(IOMUXC_GPR, kIOMUXC_GPR_ENET1TxClkOutputDir, true);
}

static void _delay(void)
{
    volatile int i = 1000000;

    while (i--)
        i = i;
}

static void _enet_phy_reset_by_gpio(void)
{
    gpio_pin_config_t gpio_config = {kGPIO_DigitalOutput, 0, kGPIO_NoIntmode};

    GPIO_PinInit(GPIO1, 10, &gpio_config);
    /* pull up the ENET_INT before RESET. */
    GPIO_WritePinOutput(GPIO1, 10, 1);
    PCF8574_WriteBit(7, 1);
    rt_thread_delay(100);
    PCF8574_WriteBit(7, 0);
}

static void _enet_config(void)
{
    enet_config_t config;
    uint32_t sysClock;

    /* prepare the buffer configuration. */
    enet_buffer_config_t buffConfig =
    {
        ENET_RXBD_NUM,
        ENET_TXBD_NUM,
        SDK_SIZEALIGN(ENET_RXBUFF_SIZE, ENET_BUFF_ALIGNMENT),
        SDK_SIZEALIGN(ENET_TXBUFF_SIZE, ENET_BUFF_ALIGNMENT),
        &g_rxBuffDescrip[0],
        &g_txBuffDescrip[0],
        &g_rxDataBuff[0][0],
        &g_txDataBuff[0][0],
    };

    /* Get default configuration. */
    /*
     * config.miiMode = kENET_RmiiMode;
     * config.miiSpeed = kENET_MiiSpeed100M;
     * config.miiDuplex = kENET_MiiFullDuplex;
     * config.rxMaxFrameLen = ENET_FRAME_MAX_FRAMELEN;
     */
    ENET_GetDefaultConfig(&config);
    config.interrupt = kENET_TxFrameInterrupt | kENET_RxFrameInterrupt;
    //config.interrupt = 0xFFFFFFFF;
    config.miiSpeed = imxrt_eth_device.speed;
    config.miiDuplex = imxrt_eth_device.duplex;

    /* Set SMI to get PHY link status. */
    sysClock = CLOCK_GetFreq(kCLOCK_AhbClk);

    dbg_log(DBG_LOG, "deinit\n");
    ENET_Deinit(imxrt_eth_device.enet_base);
    dbg_log(DBG_LOG, "init\n");
    ENET_Init(imxrt_eth_device.enet_base, &imxrt_eth_device.enet_handle, &config, &buffConfig, &imxrt_eth_device.dev_addr[0], sysClock);
    dbg_log(DBG_LOG, "set call back\n");
    ENET_SetCallback(&imxrt_eth_device.enet_handle, _enet_callback, &imxrt_eth_device);
    dbg_log(DBG_LOG, "active read\n");
    ENET_ActiveRead(imxrt_eth_device.enet_base);
}

#if defined(ETH_RX_DUMP) ||  defined(ETH_TX_DUMP)
static void packet_dump(const char *msg, const struct pbuf *p)
{
    const struct pbuf *q;
    rt_uint32_t i, j;
    rt_uint8_t *ptr;

    rt_kprintf("%s %d byte\n", msg, p->tot_len);

    i = 0;
    for (q = p; q != RT_NULL; q = q->next)
    {
        ptr = q->payload;

        for (j = 0; j < q->len; j++)
        {
            if ((i % 8) == 0)
            {
                rt_kprintf("  ");
            }
            if ((i % 16) == 0)
            {
                rt_kprintf("\r\n");
            }
            rt_kprintf("%02x ", *ptr);

            i++;
            ptr++;
        }
    }

    rt_kprintf("\n\n");
}
#else
#define packet_dump(...)
#endif /* dump */

/* initialize the interface */
static rt_err_t rt_imxrt_eth_init(rt_device_t dev)
{
    dbg_log(DBG_LOG, "rt_imxrt_eth_init...\n");
    _enet_config();

    return RT_EOK;
}

static rt_err_t rt_imxrt_eth_open(rt_device_t dev, rt_uint16_t oflag)
{
    dbg_log(DBG_LOG, "rt_imxrt_eth_open...\n");
    return RT_EOK;
}

